---
kind: other
id: Methods.T:Autodesk.Revit.DB.ScheduleSheetInstance
source: html/0f2856f3-e3c6-c68d-0dd1-edfff397b5d2.htm
---
# ScheduleSheetInstance Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.